# BalusterPattern Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BalusterPlacement..::..BalusterPattern Property
BalusterPlacement Class See Also
---
Accesses the object containing properties related to the baluster pattern.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public BalusterPattern BalusterPattern { get; }
```

Visual Basic
---
```text
Public ReadOnly Property BalusterPattern As BalusterPattern
	Get
```

Visual C++
---
```text
public:
property BalusterPattern^ BalusterPattern {
	BalusterPattern^ get ();
}
```

# See Also
BalusterPlacement Class
Autodesk.Revit.DB.Architecture Namespace